<?php
return [
    'addSuccess' => 'Данные успешно добавлены',
    'editSuccess' => 'Данные успешно изменены',
    'deleteSuccess' => 'Данные успешно удалены',
    'addFail' => 'Ошибка добавления данных',
    'editFail' => 'Ошибка изменения данных',
    'deleteFail' => 'Ошибка удаления данных',
    'empty' => 'Не заполнено поле',
    'count' => 'Поле %s не должно содержать более %d символов(а)',
    'curlFail' => 'Отсутствует библиотека CURL',
    'curlSuccess' => 'Карта сайта создана. Количество ссылок - %s.',
    'codeCurlFail' => 'Неправильный заголовок ответа - %s',
    'parsingTableFail' => 'Ошибка создания служебной таблицы parsing_table',
    'parsingFail' => 'Ошибка парсинга сайта',
    'mesCurlFail' => 'Ошибка загрузки %1$s, http code: %2$s, error: %3$s, message: %4$s,',
    'typeCurlFail' => 'Неправильный тип контента - %s',
];