<?php
return [
    1 =>
    ['dir' => 'p1', 'desc' => 'Скрипт, который выводит для числа $x его значение разным цветом: 
    зеленым - если $x положительно, желтым - если $x равно нулю, красным - если $x отрицательно. 
    Используются только условные операторы.'],
    #2 =>
    ['dir' => 'p2', 'desc' => 'Скрипт, определяющий сумму максимального и минимального из трех 
    чисел $a, $b, $c. Используются только условные операторы.'],
    #3 =>
    ['dir' => 'p3', 'desc' => 'Скрипт, определяющий максимальное из четырех
    чисел $a, $b, $c, $d. Используются только условные операторы.'],
    #4 =>
    ['dir' => 'p4', 'desc' => 'Скрипт, определяющий максимальное из четырех
    чисел $a, $b, $c, $d. с выводом наименований переменных. Используются только условные операторы.'],
    #5 =>
    ['dir' => 'p5', 'desc' => 'Скрипт, определяющий поместится ли товар в сумку, когда известны длина и ширина сумки $a, $b,
    а также длина и ширина товара $c, $d. Ввод длины и ширины в произвольном порядке. Используются только условные операторы.  Вариант 1.'],
    #6 =>
    ['dir' => 'p6', 'desc' => 'Скрипт, определяющий поместится ли товар в сумку, когда известны длина и ширина сумки $a, $b,
    а также длина и ширина товара $c, $d. Ввод длины и ширины в произвольном порядке. Используются только условные операторы.  Вариант 2.'],
    #7 =>
    ['dir' => 'p7', 'desc' => 'Скрипт, определяющий поместится ли товар в сумку, когда известны длина, ширина и высота сумки $a, $b, $e
    а также длина, ширина и высота товара $c, $d , $f. Ввод длины, ширины и высоты в произвольном порядке. Используются только условные операторы.
      Вариант 1.'],
    #8 =>
    ['dir' => 'p8', 'desc' => 'Скрипт, определяющий поместится ли товар в сумку, когда известны длина, ширина и высота сумки $a, $b, $e
    а также длина, ширина и высота товара $c, $d , $f. Ввод длины, ширины и высоты в произвольном порядке. Используются только условные операторы.
      Вариант 2.'],
];
